БухЭксп/InformationRegisters/СертификатыПодписантовМобильнойПодписиБЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СертификатыПодписантовМобильнойПодписиБЭД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидМобильнойПодписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМобильныхПодписей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодписантыСервисаМобильнойПодписи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/СертификатыПодписантовМобильнойПодписиБЭД/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр
// Параметры:
//  Подписант - СправочникСсылка.ПодписантыСервисаМобильнойПодписи - Подписант
//  Сертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - Сертификат
//  ВидМобильнойПодписи - ПеречислениеСсылка.ВидыМобильныхПодписей - Вид мобильной подписи.
//
Процедура ДобавитьЗапись(Подписант, Сертификат, ВидМобильнойПодписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.СертификатыПодписантовМобильнойПодписиБЭД");
		ЭлементБлокировкиДанных.УстановитьЗначение("Подписант", Подписант);
		ЭлементБлокировкиДанных.УстановитьЗначение("Сертификат", Сертификат);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Запись = СоздатьМенеджерЗаписи();
		Запись.Подписант = Подписант;
		Запись.Сертификат = Сертификат;
		Запись.ВидМобильнойПодписи = ВидМобильнойПодписи;
		Запись.Записать(Истина);

		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Информация = ИнформацияОбОшибке();
		
		ЭлектронноеВзаимодействие.ОбработатьОшибку(НСтр("ru = 'Добавление сертификата подписанта'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(Информация),
			СтрШаблон(НСтр("ru = 'Не удалось записать сертификат подписанта: %1'"), Подписант));

	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
